## Section 1 - Setup

**Purpose**: establish the environment and database connection.
- Import required libraries (sqlalchemy, pandas, etc.).
- Connect Python to the MySQL via SQLAlchemy.
- Validate the connection with a version check.
- Create helper functions (run_sql, run_sql_file) that allow you to execute schema/seed scripts or individual queries from the notebook.
  
### 1.1. Imports and database(DB) connection

In [160]:
import os
from pathlib import Path
from sqlalchemy import create_engine, text # builds DB engine & wrap SQL 
import pandas as pd
from IPython.display import display, Markdown # Tables and markdown 

DB_URL = "mysql+pymysql://app:app_pw@127.0.0.1:3306/mymobile" # SQLAlchemy connection
engine = create_engine(DB_URL, future=True) # 

# Test connection
with engine.connect() as conn:
    print("Connected! MySQL version:", conn.execute(text("SELECT VERSION()")).scalar())

Connected! MySQL version: 8.0.43

---
### 1.2 Helper Functions
`run_sql(sql: str)`

- Executes one or more SQL statements as a single transaction (splits on ;).
  
- If any statement fails, the whole transaction rolls back, so the DB never ends up half-applied.
	
`run_sql_file(path: str)`

- Loads a .sql file and calls run_sql on its contents
  
- This keeps schema/seed scripts versioned in /sql while letting the notebook drive execution.

In [161]:
def run_sql(sql: str):
    """
    Execute one or more SQL statements as a single transaction.
    Splits on ';' and run each statement in order.
    If any statement fails, the whole thing is rolled back.
    """
    with engine.begin() as conn:      # single transaction
        for stmt in sql.split(';'):
            if stmt.strip():
                conn.execute(text(stmt))

def run_sql_file(path: str):
    run_sql(Path(path).read_text())

---
## Section 2 - Build the Database

**Purpose:** create the relational schema that models MyMobile’s core operations.

**Design requirements covered in the schema:**
- Customers:  ID, name, address, phone number, email address, and birthdate
- Plans: type, name, duration, cost, features
- Transactions: plan activations, plan renewals, plan changes, payment information, and customer cancellations
- Call traffic: call ID, call date, call duration, call type (local, national, international), and call cost
- Customer Plan: link customers to their plans -> customer ID and plan ID
- Cancellations: cancellation ID, cancellation date, customer ID, and cancellation reason.

**What is performed in this section**:
1.	Apply schema (01_schema.sql) to create six normalized tables with constraints and relationships.
2.	Verify that tables were created correctly and are empty before loading data.

---
### 2.1 Apply schema `01_schema.sql`


**⚠️ Use Carefully⚠️: 
 Running the next cell drops and recreates all tables in mymobile.

In [162]:
run_sql_file("sql/01_schema.sql")

---
### 2.2 Verification
1. List all tables in schema
2. List Columns & types in customer table
3. Check if any data exists inside schema

In [163]:
# 1. List all tables in schema
with engine.connect() as c:
    tables = c.execute(text("SHOW TABLES")).all()
    df = pd.DataFrame(tables, columns=["Table Name"])
    display(df)

# 2. List Columns & types in customer table
with engine.connect() as c:
    df_desc = pd.read_sql(text("DESCRIBE customer"), c)
display(Markdown("**Table definition: `customer`**"))
display(df_desc)

# 3. Check if any data exists inside schema
checks = [
    "SELECT COUNT(*) AS customers FROM customer",
    "SELECT COUNT(*) AS plans FROM plan",
    "SELECT COUNT(*) AS tx FROM `transaction`",
    "SELECT COUNT(*) AS calls FROM call_traffic",
    "SELECT COUNT(*) AS links FROM customer_plan",
    "SELECT COUNT(*) AS cancels FROM cancellation",
]

rows = []
with engine.connect() as c:
    for q in checks:
        rec = c.execute(text(q)).mappings().first()  # dict-like row with alias as the key
        # Each query returns one column with a clear alias (for example: 'customers')
        col_name = next(iter(rec.keys()))
        rows.append({"metric": col_name, "count": rec[col_name]})

df_counts = pd.DataFrame(rows).sort_values("metric").reset_index(drop=True)
display(Markdown("**Row counts by table / metric**"))
display(df_counts)

      Table Name
0   call_traffic
1   cancellation
2       customer
3  customer_plan
4           plan
5    transaction

**Table definition: `customer`**

         Field          Type Null  Key Default           Extra
0  customer_id           int   NO  PRI    None  auto_increment
1    full_name  varchar(100)   NO         None
2      address  varchar(255)   NO         None
3        phone   varchar(20)   NO  UNI    None
4        email  varchar(100)   NO  UNI    None
5   birth_date          date  YES         None

**Row counts by table / metric**

      metric  count
0      calls      0
1    cancels      0
2  customers      0
3      links      0
4      plans      0
5         tx      0

---
## Section 3 - Populate Database

**Purpose:** insert realistic sample data to simulate real telecom operations.

**Data added to MyMobile Database:**
1. Add four customers
2. Add four plans
3. Add several transactions for each customer
4. Add several calls for each customer
5. Add one plan cancellation

Verification: confirm that rows exist in each table and match expectations. This ensures that the seed script worked and the database supports the intended use cases

In [164]:
# Load sample data
run_sql_file("sql/02_seed.sql")

### 3.1 Verify 4 customers were added

In [165]:
df = pd.read_sql(
    text("""
        SELECT *
        FROM customer
        ORDER BY customer_id
    """),
    engine,
)
display(df)

,customer_id,full_name,address,phone,email,birth_date
0,1,Nelson Mandela,"123 Cat St, Napa, CA",555-234-1234,n.mandela@emsn.com,1985-07-18
1,2,Claudette Colvin,"456 Dog Rd, Miami, FL",555-555-5678,c.colvin@kemail.com,1992-09-05
2,3,Patrice Lumumba,"789 Croc St, Irvine, CA",555-555-9101,p.lumumba@inlook.com,1975-07-02
3,4,Ibrahim Traore,"101 Wolf Rd, Boston, MA",555-555-1213,i.traore@ucloud.com,1988-03-14

---
### 3.2 Verify 4 plans were added

In [166]:
df = pd.read_sql(
    text("""
        SELECT
            plan_id,
            plan_name,
            plan_type,
            plan_duration_days,
            plan_cost
        FROM plan
        ORDER BY plan_id
    """),
    engine,
)
display(df)

   plan_id   plan_name   plan_type  plan_duration_days  plan_cost
0        1      Simple  Individual                  90      120.0
1        2      Family      Shared                 180      180.0
2        3  Influencer  Individual                 180      300.0
3        4        Data   Data Only                  60      100.0

---
### 3.3 Verify several transactions were added for each customer

In [167]:
pd.read_sql(text("""
SELECT 
    c.full_name,
    p.plan_name,
    t.transaction_type, 
    t.transaction_date, 
    t.transaction_amount
FROM `transaction` t
JOIN customer c ON c.customer_id = t.customer_id
JOIN plan     p ON p.plan_id     = t.plan_id
ORDER BY c.customer_id, t.transaction_date;
"""), engine.connect())

,full_name,plan_name,transaction_type,transaction_date,transaction_amount
0,Nelson Mandela,Simple,activation,2024-07-01 10:15:34,120.00
1,Nelson Mandela,Simple,payment,2024-08-01 09:00:00,120.00
2,Nelson Mandela,Simple,payment,2024-09-01 09:00:00,120.00
3,Nelson Mandela,Simple,renewal,2024-10-01 09:00:00,120.00
4,Claudette Colvin,Family,activation,2024-07-05 12:00:00,180.00
5,Claudette Colvin,Family,payment,2024-08-05 12:00:00,180.00
6,Claudette Colvin,Family,payment,2024-09-05 12:00:00,180.00
7,Claudette Colvin,Family,renewal,2024-10-05 12:00:00,180.00
8,Patrice Lumumba,Influencer,activation,2024-07-10 14:30:00,300.00
9,Patrice Lumumba,Influencer,payment,2024-08-10 14:30:00,99.99
10,Patrice Lumumba,Influencer,payment,2024-09-10 14:30:00,99.99
11,Patrice Lumumba,Influencer,renewal,2024-10-10 14:30:00,300.00
12,Ibrahim Traore,Data,activation,2024-07-15 08:00:00,100.00
13,Ibrahim Traore,Data,payment,2024-08-15 08:00:00,39.99
14,Ibrahim Traore,Data,payment,2024-09-15 08:00:00,39.99
15,Ibrahim Traore,Data,renewal,2024-10-15 08:00:00,100.00

---
### 3.4 Verify several calls were added for each customer

In [168]:
pd.read_sql(text("""
SELECT 
    c.full_name, 
    t.call_type, 
    t.call_start,
    t.call_end,
    t.call_cost
FROM call_traffic t
JOIN customer c ON c.customer_id = t.customer_id
ORDER BY c.customer_id, t.call_start;
"""), engine.connect())

,full_name,call_type,call_start,call_end,call_cost
0,Nelson Mandela,local,2024-07-02 10:00:00,2024-07-02 10:05:00,0.75
1,Nelson Mandela,international,2024-07-03 21:10:00,2024-07-03 21:25:00,6.40
2,Nelson Mandela,national,2024-07-05 08:00:00,2024-07-05 08:03:00,0.45
3,Claudette Colvin,local,2024-07-06 12:10:00,2024-07-06 12:25:00,0.90
4,Claudette Colvin,international,2024-07-08 20:00:00,2024-07-08 20:12:00,5.25
5,Claudette Colvin,national,2024-07-10 14:00:00,2024-07-10 14:05:00,0.60
6,Patrice Lumumba,local,2024-07-11 09:30:00,2024-07-11 09:42:00,0.85
7,Patrice Lumumba,international,2024-07-12 23:05:00,2024-07-12 23:40:00,8.90
8,Ibrahim Traore,local,2024-07-16 18:00:00,2024-07-16 18:10:00,1.10
9,Ibrahim Traore,national,2024-07-18 07:45:00,2024-07-18 07:55:00,0.80

---
### 3.5 Verify one cancellation of a plan was added for one customer

In [169]:
with engine.connect() as c:
    df = pd.read_sql(
        text("""
            SELECT
                c.full_name,
                x.cancellation_date,
                x.cancellation_reason
            FROM cancellation AS x
            JOIN customer     AS c ON c.customer_id = x.customer_id
            ORDER BY c.full_name, x.cancellation_date
        """),
        c,
    )
display(df)

          full_name cancellation_date  cancellation_reason
0  Claudette Colvin        2024-10-20  Switching providers

---
## Section 4 - Queries
**Purpose:** demonstrate the database in action by running three queries:

1. Customer Summary - displaying all plans for each customer, including any cancellations

2. Customer Call Log - call history with calculated durations.

3. Plan Revenue report - revenue for each plan

### 4.1 Customer Summary

In [170]:
pd.read_sql(text("""
SELECT
    c.customer_id,
    c.full_name,
    p.plan_id,
    p.plan_name,
    p.plan_type,
    CASE WHEN can.cancellation_id IS NOT NULL THEN 1 ELSE 0 END AS is_canceled,
    can.cancellation_date,
    can.cancellation_reason
FROM customer c
LEFT JOIN customer_plan cp ON cp.customer_id = c.customer_id
LEFT JOIN plan p          ON p.plan_id     = cp.plan_id
LEFT JOIN cancellation can ON can.customer_id = c.customer_id
ORDER BY c.customer_id, p.plan_name;
"""), engine.connect())

,customer_id,full_name,plan_id,plan_name,plan_type,is_canceled,cancellation_date,cancellation_reason
0,1,Nelson Mandela,1,Simple,Individual,0,None,None
1,2,Claudette Colvin,2,Family,Shared,1,2024-10-20,Switching providers
2,3,Patrice Lumumba,3,Influencer,Individual,0,None,None
3,4,Ibrahim Traore,4,Data,Data Only,0,None,None

---
### 4.2 Customer Call Log

In [171]:
pd.read_sql(text("""
SELECT
    ct.call_id,
    c.customer_id,
    c.full_name,
    ct.call_start,
    ct.call_end,
    TIMESTAMPDIFF(MINUTE, ct.call_start, ct.call_end) AS call_duration_minutes,
    ct.call_type,
    ct.call_cost
FROM call_traffic AS ct
JOIN customer AS c
  ON c.customer_id = ct.customer_id
ORDER BY c.customer_id, ct.call_start;
"""), engine.connect())

,call_id,customer_id,full_name,call_start,call_end,call_duration_minutes,call_type,call_cost
0,1,1,Nelson Mandela,2024-07-02 10:00:00,2024-07-02 10:05:00,5,local,0.75
1,2,1,Nelson Mandela,2024-07-03 21:10:00,2024-07-03 21:25:00,15,international,6.40
2,3,1,Nelson Mandela,2024-07-05 08:00:00,2024-07-05 08:03:00,3,national,0.45
3,4,2,Claudette Colvin,2024-07-06 12:10:00,2024-07-06 12:25:00,15,local,0.90
4,5,2,Claudette Colvin,2024-07-08 20:00:00,2024-07-08 20:12:00,12,international,5.25
5,6,2,Claudette Colvin,2024-07-10 14:00:00,2024-07-10 14:05:00,5,national,0.60
6,7,3,Patrice Lumumba,2024-07-11 09:30:00,2024-07-11 09:42:00,12,local,0.85
7,8,3,Patrice Lumumba,2024-07-12 23:05:00,2024-07-12 23:40:00,35,international,8.90
8,9,4,Ibrahim Traore,2024-07-16 18:00:00,2024-07-16 18:10:00,10,local,1.10
9,10,4,Ibrahim Traore,2024-07-18 07:45:00,2024-07-18 07:55:00,10,national,0.80

---
### 4.3 Plan Revenue Report

In [172]:
pd.read_sql(text("""
SELECT
    p.plan_id,
    p.plan_name,
    p.plan_type,
    COALESCE(SUM(t.transaction_amount), 0) AS total_revenue
FROM plan AS p
LEFT JOIN `transaction` AS t
    ON t.plan_id = p.plan_id
GROUP BY p.plan_id, p.plan_name, p.plan_type
ORDER BY total_revenue DESC;
"""), engine.connect())

   plan_id   plan_name   plan_type  total_revenue
0        3  Influencer  Individual         799.98
1        2      Family      Shared         720.00
2        1      Simple  Individual         480.00
3        4        Data   Data Only         279.98